import io
import sys

_INPUT = """\
5
0 1 1 0 0
1 0 0 1 1
1 0 0 0 0
0 1 0 0 1
0 1 0 1 0
"""
sys.stdin = io.StringIO(_INPUT)

# ---------------------------------------------------------------------------------------------------------
# 無向グラフの辺の数を出力
# 同じ辺が 2 回数えられているので、edges / 2 を出力します。
# ---------------------------------------------------------------------------------------------------------

N = int(input())
G = [list(map(int, input().split())) for _ in range(N)]

edges = 0

for i in range(N):
    for j in range(N):
        if G[i][j] == 1:
            edges += 1


print(edges // 2)
