import io
import sys

_INPUT = """\
3 2
1
2
2
1 3
1
2
"""
sys.stdin = io.StringIO(_INPUT)

# ---------------------------------------------------------------------------------------------------------
# 隣接頂点の出力
# 自己ループと多重辺は考えません。
# ---------------------------------------------------------------------------------------------------------
# N = int(input())
# N, X, Y = map(int, input().split())
n,s = map(int, input().split())

G = [[] for _ in range(n)]

for i in range(n):
    a = int(input())
    G[i] = a-1

print(G)
