import io
import sys

_INPUT = """\
1 5 9 7 5 3 2 5 8 4
"""
sys.stdin = io.StringIO(_INPUT)

# ---------------------------------------------------------------------------------------------------------
# 区間の和 1
# 累積和は、一言でいうと「適切な前処理をおこない、
# 配列上の区間の総和を高速で処理できるようにする手法」
# 数列 a の範囲を [left, right) としたとき、この範囲の総和は s[right] - s[left] で求めることができる
# ---------------------------------------------------------------------------------------------------------
# N = int(input())
# N, X, Y = map(int, input().split())
nums = list(map(int, input().split()))
cuv = [0]*(len(nums)+1)

for i in range(1,len(nums)+1):
    cuv[i] = cuv[i-1] + nums[i-1]

print(cuv[8]-cuv[2])