import io
import sys

_INPUT = """\
0 7 9
"""
sys.stdin = io.StringIO(_INPUT)

# ---------------------------------------------------------------------------------------------------------
# 無向グラフの入力
#
# ---------------------------------------------------------------------------------------------------------
# N = int(input())
# N, X, Y = map(int, input().split())

x, d, k = map(int, input().split())

a = [0] * k

a[0] = x
a[1] = x + d
for i in range(2, k):
    a[i] = a[i - 1] + d
print(a)
print(a[-1])
