import io
import sys

_INPUT = """\
7
"""
sys.stdin = io.StringIO(_INPUT)

# ---------------------------------------------------------------------------------------------------------
# 無向グラフの入力
#
# ---------------------------------------------------------------------------------------------------------
# N = int(input())
# N, X, Y = map(int, input().split())

k = int(input())

ans = [0] * (k + 1)

ans[1] = 1
ans[2] = 1

for i in range(2, k + 1):
    ans[i] = ans[i - 2] + ans[i - 1]

print(ans[k])
