import io
import sys

_INPUT = """\
5 100 150
"""
sys.stdin = io.StringIO(_INPUT)

# ---------------------------------------------------------------------------------------------------------
# 無向グラフの入力
#
# ---------------------------------------------------------------------------------------------------------
# N = int(input())
# N, X, Y = map(int, input().split())

n, a, b = map(int, input().split())

ans = [1000000000000] * (1100 + 1)

ans[0] = 0
ans[1] = a

for i in range(2, 1100 + 1):
    ans[i] = min(ans[i - 1] + a, ans[i - 2] + b)

print(ans[n])
